coq/aula6.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt" xml:lang="pt">
<head>
<!-- 2018-05-12 sáb 11:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Aula 6 - Duplas de Naturais</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Rafael Castro - rafaelcgs10.github.io/coq" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Aula 6 - Duplas de Naturais</h1>

<div id="outline-container-orgf637152" class="outline-2">
<h2 id="orgf637152"><span class="section-number-2">1</span> Tipo Produto de Naturais</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org88ceefa" class="outline-3">
<h3 id="org88ceefa"><span class="section-number-3">1.1</span> Produto</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Produto, par ordenado, dupla etc&#x2026;.</li>
<li>Uma sequência finita de elementos, cuja ordem importa.</li>
<li>Os elementos de uma dupla podem ser de tipos diferentes: (1, 'a'). Mas não por hora.</li>
</ul>
</div>
</div>

<div id="outline-container-org9adc544" class="outline-3">
<h3 id="org9adc544"><span class="section-number-3">1.2</span> Tipo Produdo de Naturais em Coq</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Inductive</span> <span style="color: #93E0E3;">natprod</span> : <span style="color: #7CB8BB;">Type</span> :=
| pair : nat -&gt; nat -&gt; natprod.

<span style="color: #F0DFAF; font-weight: bold;">Check</span> (pair 3 5).
</pre>
</div>
</div>
</div>

<div id="outline-container-orge81647b" class="outline-3">
<h3 id="orge81647b"><span class="section-number-3">1.3</span> Projeções do Produto</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Definimos duas funções que projetam o primeiro e o segundo elemento do par.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Definition</span> <span style="color: #93E0E3;">fst</span> (<span style="color: #DFAF8F;">p</span> : natprod) : nat :=
  <span style="color: #7CB8BB;">match</span> p <span style="color: #7CB8BB;">with</span>
  | pair x y =&gt; x
  <span style="color: #7CB8BB;">end</span>.

<span style="color: #F0DFAF; font-weight: bold;">Definition</span> <span style="color: #93E0E3;">snd</span> (<span style="color: #DFAF8F;">p</span> : natprod) : nat :=
  <span style="color: #7CB8BB;">match</span> p <span style="color: #7CB8BB;">with</span>
  | pair x y =&gt; y
  <span style="color: #7CB8BB;">end</span>.

Compute (fst (pair 3 5)).
<span style="color: #5F7F5F;">(* </span><span style="color: #7F9F7F;">===&gt; 3 </span><span style="color: #5F7F5F;">*)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7945288" class="outline-3">
<h3 id="org7945288"><span class="section-number-3">1.4</span> Uma notação para facilitar a vida</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Definimos uma notação para duplas.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Notation</span> <span style="color: #CC9393;">"( x , y )"</span> := (pair x y).
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9063246" class="outline-2">
<h2 id="org9063246"><span class="section-number-2">2</span> Função <i>swap</i></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Definimos uma função que troca os elementos de uma dupla.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Definition</span> <span style="color: #93E0E3;">swap_pair</span> (<span style="color: #DFAF8F;">p</span> : natprod) : natprod :=
  <span style="color: #7CB8BB;">match</span> p <span style="color: #7CB8BB;">with</span>
  | (x,y) =&gt; (y,x)
  <span style="color: #7CB8BB;">end</span>.
</pre>
</div>
</div>

<div id="outline-container-orgb731e8b" class="outline-3">
<h3 id="orgb731e8b"><span class="section-number-3">2.1</span> Alguns fatos sobre duplas</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Vamos demonstrar alguns fatos simples sobre o tipo dupla de naturais.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">surjective_pairing'</span> : <span style="color: #7CB8BB;">forall</span> (<span style="color: #DFAF8F;">n m</span> : nat),
  (n,m) = (fst (n,m), snd (n,m)).
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF;">reflexivity</span>.  <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>


<div id="outline-container-org90779c2" class="outline-3">
<h3 id="org90779c2"><span class="section-number-3">2.2</span> Um caso que a simplificação não funciona</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Se tentarmos utilizar a simplificação aqui não vai ser possível.</li>
<li>Ainda que <i>p</i> seja um <i>natprod</i> para fazer o casamento de padrão é necessário expor a sua estrutura para fazer o casamento de padrão.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">surjective_pairing_stuck</span> : <span style="color: #7CB8BB;">forall</span> (<span style="color: #DFAF8F;">p</span> : natprod),
  p = (fst p, snd p).
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">simpl</span>. <span style="color: #5F7F5F;">(* </span><span style="color: #7F9F7F;">Doesn't reduce anything! </span><span style="color: #5F7F5F;">*)</span>
<span style="color: #F0DFAF; font-weight: bold;">Abort</span>.
</pre>
</div>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">surjective_pairing</span> : <span style="color: #7CB8BB;">forall</span> (<span style="color: #DFAF8F;">p</span> : natprod),
  p = (fst p, snd p).
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">intros</span> p.  <span style="color: #BFEBBF; background-color: #3F3F3F;">destruct</span> p <span style="color: #7CB8BB;">as</span> [n m].  <span style="color: #BFEBBF; background-color: #3F3F3F;">simpl</span>.  <span style="color: #BFEBBF;">reflexivity</span>.  <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 14/05/2018</p>
<p class="author">Author: Rafael Castro - rafaelcgs10.github.io/coq</p>
<p class="date">Created: 2018-05-12 sáb 11:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
